   /*/----------------------!!!----------------------------/*/
  /*/ Before compilation Save with Encoding Windows 1251  /*/
 /*/              Saved in Encoding UTF-8                /*/
/*/-------------------------!!!-------------------------/*/
#include <stdio.h>
#include <stdlib.h>
#include "default_cfg.h"
                                 /////////////////////////////////////////////////////////////
#define _yellow SetColor(14,0); // жовний вивід тексту на екран + чорний фон               //
#define _red SetColor(12,0);   // червоний вивід тексту на екран + чорний фон             //
#define _green SetColor(10,0);// повернення зеленого виводу тексту на екран + чорний фон //
                             /////////////////////////////////////////////////////////////
struct table{
 int s1;
 char s2[10];
 int s3;
 int s4;
};

int main()
{
	start_cfg(); // default_cfg.h
	printf("\nГ=====================================================================|");
	printf("\n|%-69s|","Проекти пошуку наземних сигналів");
	printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");
	printf("\n|%-6s |%-17s |%-18s |%-20s  |", "Рік", "Науковий керівник", "Діаметр антени (м)", "Робоча частота (МГц)");
	printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");
	

struct table tlist[3] = {
	{1960, "Дрейк", 26, 1420},
	{1970, "Троїцький", 14, 1875},
	{1978, "Хоровиць", 300, 1665}	
};

for (int i = 0; i < 3; i++)
{
	printf("\n|%-6d |%-17s |%-18d |%-20d  |", tlist[i].s1, tlist[i].s2, tlist[i].s3, tlist[i].s4);
	printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");
}

	printf("\n|Зауваження: спостерігались об’єкти від 2 зірок до декількох галактик |");
	printf("\n|_____________________________________________________________________|");
	


	end_cfg(); // default_cfg.h
	return 0;
}