   /*/----------------------!!!----------------------------/*/
  /*/ Before compilation Save with Encoding Windows 1251  /*/
 /*/              Saved in Encoding UTF-8                /*/
/*/-------------------------!!!-------------------------/*/
#include <stdio.h>
#include "default_cfg.h"
struct table
{
	int s1; //Рік
	char s2[10]; //Науковий керівник
	int s3; //Діаметр антени (м)
	int s4; //Робоча частота (МГц)
};

void print_table(struct table *tlist, int N); // Виводить таблицю на екран
void sort_table(struct table *tlist, int N); // сортує таблицю за зростанням першого стовпчика в рядку

int main()
{
start_cfg(); // default_cfg.h

	struct table tlist[] = {// масив структур з рядками таблиці
		{1960, "Дрейк", 26, 1420},
		{1970, "Троїцький", 14, 1875},
		{1978, "Хоровиць", 300, 1665}
	};
	int N = sizeof(tlist)/sizeof(tlist[0]); // Кількість рядків в таблиці

	printf("\n%47s", "Таблиця до сортування:");
	print_table(tlist, N);

	sort_table(tlist, N); // сортує таблицю за зростанням першого стовпчика в рядку

	printf("\n%49s", "Таблиця після сортування:");
	print_table(tlist, N);
	
	end_cfg(); // default_cfg.h
	return 0;
}
//////////////////////////////////////////////////////////////////////
void print_table(struct table *tlist, int N){
	printf("\nГ=====================================================================|");
	printf("\n|%-69s|","Проекти пошуку наземних сигналів");
	printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");
	printf("\n|%-6s |%-17s |%-18s |%-20s  |", "Рік", "Науковий керівник", "Діаметр антени (м)", "Робоча частота (МГц)");
	printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");

	for (int i = 0; i < N; i++) // виводить всі рядки таблиці
	{
		printf("\n|%-6d |%-17s |%-18d |%-20d  |", tlist[i].s1, tlist[i].s2, tlist[i].s3, tlist[i].s4);
		printf("\n|~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~|");
	}
	printf("\n|Зауваження: спостерігались об’єкти від 2 зірок до декількох галактик |");
	printf("\n|_____________________________________________________________________|\n");
}
//////////////////////////////////////////////////////////////////////
void sort_table(struct table *tlist, int N){
	struct table tmp1; // для тимчасового зберігання рядка при сортіровці
	for (int i = N - 1; i >= 0; i--)
	{
		for (int j = 1; j < N; j++)
		{
			if (tlist[j].s1 < tlist[j-1].s1) // якщо число в першому стовпчику менше від попереднього - міняємо рядки містцями
			{
				tmp1 = tlist[j];
				tlist[j] = tlist[j-1];
				tlist[j-1] = tmp1;
			}
		}
	}
}